# Taps
tap "mikescher/tap"

# CLI Tools
brew "bat"           # Better cat
brew "btop"          # Resource monitor
brew "difftastic"    # Structural diffs
brew "dust"          # Better du
brew "eza"           # Better ls
brew "fastfetch"     # System info display
brew "fd"            # Better find
brew "fileicon"      # Set custom file/app icons
brew "fzf"           # Fuzzy finder
brew "git-delta"     # Git syntax highlighting
brew "lazydocker"    # Docker TUI
brew "mikescher/tap/dops"  # Better docker ps
brew "procs"         # Better ps
brew "mcat"          # Markdown cat
brew "repomix"       # AI context generation
brew "treemd"        # Markdown directory trees
brew "starship"      # Shell prompt
brew "tldr"          # Simplified man pages
brew "tmux"          # Terminal multiplexer
brew "zoxide"        # Smart cd

# Fonts
cask "font-fira-code-nerd-font"

# Apps
cask "wezterm"
cask "visual-studio-code"
